app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks"
---
  <option>Select Task Type</option>
  <%= Task.all_kinds.each do |task| %>