app/views/tasks/show.html.erb

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = 3
---
  </tr>
<% @task.subtasks.each do |subtask| %>