app/controllers/subtasks_controller.rb

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = 3 AND "subtasks"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @subtask = @task.subtasks.find(params[:id])

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = 3 AND "subtasks"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @subtask = @task.subtasks.find(params[:id])

INSERT INTO "subtasks" ("created_at", "description", "is_done", "task_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Mar 2015 18:48:47 UTC +00:00], ["description", "asdfasdfasdfasdfads"], ["is_done", true], ["task_id", 3], ["updated_at", Sun, 08 Mar 2015 18:48:47 UTC +00:00]]
---
  def create
    @subtask = @task.subtasks.create(params[:subtask])

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = 4 AND "subtasks"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "subtasks" SET "is_done" = 'f', "description" = 'foo', "updated_at" = '2015-03-10 19:09:43.614031' WHERE "subtasks"."id" = 6
---
  def update
    @subtask = @task.subtasks.find(params[:id])
    puts "task controll update function"
    puts "should some parameter"
    respond_to do |format|
      puts params[:subtask]
      if @subtask.update_attributes(params[:subtask])

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = 4 AND "subtasks"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "subtasks" WHERE "subtasks"."id" = ?  [["id", 9]]
---
  def destroy
    @subtask = @task.subtasks.find(params[:id])
    @subtask.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def load_task
    @task = Task.find(params[:task_id])