app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 2
---
    end

    if filter_argument == nil and show_finished == nil
      @tasks = Task.where("status != ? AND user_id = ?", "Finished", current_user).order(sort_argument)

SELECT "tasks".* FROM "tasks"
---
    elsif filter_argument != nil
      @tasks = Task.where("status != ? AND user_id = ?", "Finished", current_user).order(sort_argument).where("kind = ?", filter_argument)
    else
      @tasks = @tasks.order(sort_argument)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    begin
      @task = Task.accessible_by(current_ability).find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "15"]]
---
  def edit
    begin
      @task = Task.accessible_by(current_ability).find(params[:id])

INSERT INTO "tasks" ("course", "created_at", "due", "kind", "release", "status", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = current_user.tasks.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "tasks" SET "release" = '2015-03-13 07:59:00.000000', "due" = '2015-03-20 07:59:00.000000', "updated_at" = '2015-03-10 05:20:46.921318' WHERE "tasks"."id" = 1
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])